app/controllers/entretiens_controller.rb

    def create

        entretien = Entretien.new
        entretien.operation_id = params[:entretien][:operation_id]
        entretien.date = params[:entretien][:date]
        entretien.km = params[:entretien][:km]
        entretien.description = params[:entretien][:description]
        entretien.prix = params[:entretien][:prix]
        entretien.moto_id = @moto.id

        entretien.save!
---
INSERT INTO "entretiens" ("description", "date", "km", "prix", "moto_id", "operation_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "huilde castrol 5w40"], ["date", "2020-01-02"], ["km", 1000], ["prix", "50"], ["moto_id", 1], ["operation_id", 1]]

    def set_moto
        @moto = Moto.find(params[:moto_id])
---
SELECT  "motos".* FROM "motos" WHERE "motos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]