app/controllers/home_controller.rb

SELECT "motos".* FROM "motos" WHERE "motos"."user_id" IS NULL ORDER BY "motos"."id" ASC
SELECT "marques".* FROM "marques" ORDER BY "marques"."nom" DESC
---
  def dashboard

      @motos = Moto.where(user_id: current_user)
      @moto = Moto.new
      @marques = Marque.all.order(nom: "ASC")

SELECT "modeles".* FROM "modeles" WHERE "modeles"."marque_id" = ?  [["marque_id", 1]]
---
  def double_select

      @modeles = Modele.where(marque_id: params[:id])