app/controllers/motos_controller.rb

    def create

        moto = Moto.new
        moto.user_id = current_user.id
        moto.date_circu = params[:moto][:date_circu]
        moto.km = params[:moto][:km]
        moto.date_modif = Time.now
        moto.modele_id = params[:moto][:modele]
        moto.marque_id = params[:moto][:marque_id]

        moto.save!
---
INSERT INTO "motos" ("user_id", "date_circu", "km", "date_modif", "modele_id", "marque_id") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["date_circu", "2020-01-01 00:00:00"], ["km", 5], ["date_modif", "2020-01-03 13:25:34.225647"], ["modele_id", 3], ["marque_id", 3]]

    def detail

        @operations = Operation.all.order(id: "ASC")
        @entretien = Entretien.new
        @historique = Entretien.all.where(moto_id: @moto.id)
---
SELECT "operations".* FROM "operations" ORDER BY "operations"."id" ASC
SELECT "entretiens".* FROM "entretiens" WHERE "entretiens"."moto_id" = ? ORDER BY "entretiens"."id" ASC  [["moto_id", 2]]

    def update_km

        @moto.km = params[:moto][:km]
        @moto.save!
---
UPDATE "motos" SET "km" = ? WHERE "motos"."id" = ?  [["km", 1501], ["id", 1]]

    def destroy

        @moto.delete
---
DELETE FROM "motos" WHERE "motos"."id" = ?  [["id", 1]]

    def set_moto

        @moto = Moto.find(params[:moto_id])
---
SELECT  "motos".* FROM "motos" WHERE "motos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]